-- MySQL dump 10.13  Distrib 8.0.18, for Win64 (x86_64)
--
-- Host: localhost    Database: sp
-- ------------------------------------------------------
-- Server version	8.0.18

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `course`
--

DROP TABLE IF EXISTS `course`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `course` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '课程的id',
  `course_time` varchar(15) DEFAULT NULL,
  `course_name` varchar(45) DEFAULT NULL COMMENT '课程的姓名',
  `course_introduce` varchar(200) DEFAULT NULL COMMENT '课程的介绍',
  `course_photo` varchar(45) DEFAULT NULL COMMENT '课程的图标',
  `course_collect` varchar(45) DEFAULT '0' COMMENT '课程的收藏人数',
  `course_apply` varchar(45) DEFAULT '0' COMMENT '课程的学习人数',
  `course_teacher` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=94 DEFAULT CHARSET=utf8 COMMENT='课程的信息';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `course`
--

LOCK TABLES `course` WRITE;
/*!40000 ALTER TABLE `course` DISABLE KEYS */;
INSERT INTO `course` VALUES (1,'2019/10/18','大学生职业发展与就业指导','无','路径','0','0',1),(2,'2019/10/19','解析几何','无','路径','0','0',2),(3,'2019/10/20','数学分析1(上)','无','路径','0','0',3),(4,'2019/10/21','高等代数Ⅰ','无','路径','0','0',4),(5,'2019/10/22','计算机基础','无','路径','0','0',1),(6,'2019/10/23','体育','无','路径','0','0',2),(7,'2019/10/24','思想道德修养和法律基础','无','路径','0','0',3),(8,'2019/10/25','形势与政策Ⅰ','无','路径','0','0',4),(9,'2019/10/26','应用文写作','无','路径','0','0',1),(10,'2019/10/27','大学英语精读Ⅰ','无','路径','0','0',2),(11,'2019/10/28','心理健康教育Ⅰ','无','路径','0','0',3),(12,'2019/10/29','计算机基础实验','无','路径','0','0',4),(13,'2019/10/30','大学英语自主学习听说训练课Ⅰ','无','路径','0','0',1),(14,'2019/10/31','孙子兵法','无','路径','0','0',2),(15,'2019/11/1','积极心理学','无','路径','0','0',3),(16,'2019/11/2','数学分析1(中)','无','路径','0','0',4),(17,'2019/11/3','大学物理2','无','路径','0','0',1),(18,'2019/11/4','高等代数Ⅱ','无','路径','0','0',2),(19,'2019/11/5','程序设计基础','无','路径','0','0',3),(20,'2019/11/6','C++','无','路径','0','0',4),(21,'2019/11/7','体育选项课Ⅰ','无','路径','0','0',1),(22,'2019/11/8','马克思主义基本原理','无','路径','0','0',2),(23,'2019/11/9','形势与政策Ⅱ','无','路径','0','0',3),(24,'2019/11/10','大学英语精读Ⅱ','无','路径','0','0',4),(25,'2019/11/11','军事理论','无','路径','0','0',1),(26,'2019/11/12','心理健康教育Ⅱ','无','路径','0','0',2),(27,'2019/11/13','程序设计基础实验','无','路径','0','0',3),(28,'2019/11/14','专业认知实习(信息与计算科学)','无','路径','0','0',4),(29,'2019/11/15','C++实验','无','路径','0','0',1),(30,'2019/11/16','大学英语自主学习听说训练课Ⅱ','无','路径','0','0',2),(31,'2019/11/17','美术鉴赏','无','路径','0','0',3),(32,'2019/11/18','大学生KAB创业基础','无','路径','0','0',4),(33,'2019/11/19','JAVA程序设计','无','路径','0','0',1),(34,'2019/11/20','数学分析1(下)','无','路径','0','0',2),(35,'2019/11/21','数据结构6','无','路径','0','0',3),(36,'2019/11/22','数据库原理及其应用','无','路径','0','0',4),(37,'2019/11/23','专业英语(信息与计算科学)','无','路径','0','0',1),(38,'2019/11/24','中国近现代史纲要','无','路径','0','0',2),(39,'2019/11/25','形势与政策Ⅲ','无','路径','0','0',3),(40,'2019/11/26','大学物理2实验','无','路径','0','0',4),(41,'2019/11/27','JAVA程序设计实验','无','路径','0','0',1),(42,'2019/11/28','程序设计综合课程设计','无','路径','0','0',2),(43,'2019/11/29','数据库原理及其应用实验','无','路径','0','0',3),(44,'2019/11/30','数据结构6实验2','无','路径','0','0',4),(45,'2019/12/1','体育选项课Ⅱ','无','路径','0','0',1),(46,'2019/12/2','大学英语自主学习听说训练课Ⅲ','无','路径','0','0',2),(47,'2019/12/3','大学英语Ⅲ','无','路径','0','0',3),(48,'2019/12/4','概率论与数理统计4','无','路径','0','0',4),(49,'2019/12/5','最优化方法','无','路径','0','0',1),(50,'2019/12/6','信息与计算科学专业导论','无','路径','0','0',2),(51,'2019/12/7','VC++高级程序设计','无','路径','0','0',3),(52,'2019/12/8','面向对象分析与设计','无','路径','0','0',4),(53,'2019/12/9','数学软件','无','路径','0','0',1),(54,'2019/12/10','体育选项课Ⅲ','无','路径','0','0',2),(55,'2019/12/11','毛泽东思想和中国特色社会主义理论体系概论(上)','无','路径','0','0',3),(56,'2019/12/12','形势与政策Ⅳ','无','路径','0','0',4),(57,'2019/12/13','数学软件实验','无','路径','0','0',1),(58,'2019/12/14','WEB前端设计技术Ⅰ','无','路径','0','0',2),(59,'2019/12/15','VC++高级程序设计实验','无','路径','0','0',3),(60,'2019/12/16','面向对象分析与设计实验','无','路径','0','0',4),(61,'2019/12/17','面向对象编程课程设计','无','路径','0','0',1),(62,'2019/12/18','大学英语自主学习听说训练课Ⅳ','无','路径','0','0',2),(63,'2019/12/19','大学英语Ⅳ','无','路径','0','0',3),(64,'2019/12/20','算法分析与设计1','无','路径','0','0',4),(65,'2019/12/21','常微分方程','无','路径','0','0',1),(66,'2019/12/22','数值分析2','无','路径','0','0',2),(67,'2019/12/23','软件工程（双语）','无','路径','0','0',3),(68,'2019/12/24','数据可视化技术','无','路径','0','0',4),(69,'2019/12/25','数据挖掘','无','路径','0','0',1),(70,'2019/12/26','计算机网络2课程设计','无','路径','0','0',2),(71,'2019/12/27','软件工程(双语)课程设计','无','路径','0','0',3),(72,'2019/12/28','数值分析2实验','无','路径','0','0',4),(73,'2019/12/29','软件工程（双语）实验2','无','路径','0','0',1),(74,'2019/12/30','数据可视化技术实验','无','路径','0','0',2),(75,'2019/12/31','数据挖掘实验','无','路径','0','0',3),(76,'2020/1/1','WEB前端设计技术Ⅱ','无','路径','0','0',4),(77,'2020/1/2','微分方程数值解','无','路径','0','0',1),(78,'2020/1/3','UNIX操作系统','无','路径','0','0',2),(79,'2020/1/4','操作系统2','无','路径','0','0',3),(80,'2020/1/5','计算机网络2实验','无','路径','0','0',4),(81,'2020/1/6','信息安全','无','路径','0','0',1),(82,'2020/1/7','计算机网络2','无','路径','0','0',2),(83,'2020/1/8','信息与编码','无','路径','0','0',3),(84,'2020/1/9','毛泽东思想和中国特色社会主义理论体系概论(下)','无','路径','0','0',4),(85,'2020/1/10','计算机组成原理2','无','路径','0','0',1),(86,'2020/1/11','Android系统开发技术','无','路径','0','0',2),(87,'2020/1/12','UNIX操作系统实验','无','路径','0','0',3),(88,'2020/1/13','计算机组成原理2实验','无','路径','0','0',4),(89,'2020/1/14','信息安全实验','无','路径','0','0',1),(90,'2020/1/15','Android系统开发技术实验','无','路径','0','0',2),(92,'2020/1/17','综合实习(信息与计算科学)','无','路径','0','0',3),(93,'2020/1/18','政治理论实践课(概论下)','无','路径','0','0',4);
/*!40000 ALTER TABLE `course` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2019-10-19 12:55:15
